testing/latency-results/hipster-shop/burst/dc-15x.txt
Running 20s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread calibration: mean lat.: 32.190ms, rate sampling interval: 201ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    26.31ms   39.39ms 183.29ms   87.94%
    Req/Sec    50.29     17.04    94.00     67.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.07ms
 75.000%   33.76ms
 90.000%   75.39ms
 99.000%  183.29ms
 99.900%  208.51ms
 99.990%  313.60ms
 99.999%  313.60ms
100.000%  313.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.581     0.000000            1         1.00
       0.866     0.100000           51         1.11
       2.845     0.200000          103         1.25
       3.397     0.300000          152         1.43
       9.327     0.400000          203         1.67
      11.071     0.500000          253         2.00
      11.567     0.550000          280         2.22
      12.079     0.600000          304         2.50
      13.903     0.650000          329         2.86
      18.815     0.700000          355         3.33
      33.759     0.750000          380         4.00
      39.679     0.775000          393         4.44
      43.583     0.800000          405         5.00
      50.047     0.825000          418         5.71
      56.255     0.850000          431         6.67
      63.935     0.875000          443         8.00
      70.335     0.887500          450         8.89
      76.031     0.900000          456        10.00
      80.639     0.912500          462        11.43
      96.767     0.925000          469        13.33
     108.735     0.937500          475        16.00
     114.431     0.943750          478        17.78
     116.095     0.950000          481        20.00
     119.551     0.956250          484        22.86
     128.767     0.962500          488        26.67
     132.991     0.968750          491        32.00
     134.015     0.971875          492        35.56
     139.007     0.975000          494        40.00
     141.055     0.978125          495        45.71
     147.839     0.981250          497        53.33
     168.063     0.984375          499        64.00
     168.063     0.985938          499        71.11
     173.183     0.987500          500        80.00
     183.295     0.989062          501        91.43
     185.855     0.990625          502       106.67
     187.903     0.992188          503       128.00
     187.903     0.992969          503       142.22
     187.903     0.993750          503       160.00
     189.439     0.994531          504       182.86
     189.439     0.995313          504       213.33
     208.511     0.996094          505       256.00
     208.511     0.996484          505       284.44
     208.511     0.996875          505       320.00
     208.511     0.997266          505       365.71
     208.511     0.997656          505       426.67
     313.599     0.998047          506       512.00
     313.599     1.000000          506          inf
#[Mean    =       26.311, StdDeviation   =       39.385]
#[Max     =      313.344, Total count    =          506]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1034 requests in 20.01s, 6.10MB read
Requests/sec:     51.67
Transfer/sec:    312.34KB
Running 10s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.84s   847.52ms   3.34s    60.02%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.93s 
 75.000%    2.47s 
 90.000%    2.94s 
 99.000%    3.34s 
 99.900%    3.46s 
 99.990%    3.47s 
 99.999%    3.47s 
100.000%    3.47s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.483     0.000000            1         1.00
     636.415     0.100000          361         1.11
     959.999     0.200000          721         1.25
    1310.719     0.300000         1082         1.43
    1687.551     0.400000         1443         1.67
    1929.215     0.500000         1803         2.00
    2035.711     0.550000         1985         2.22
    2142.207     0.600000         2163         2.50
    2254.847     0.650000         2343         2.86
    2359.295     0.700000         2525         3.33
    2465.791     0.750000         2703         4.00
    2562.047     0.775000         2799         4.44
    2652.159     0.800000         2887         5.00
    2729.983     0.825000         2976         5.71
    2809.855     0.850000         3064         6.67
    2891.775     0.875000         3156         8.00
    2912.255     0.887500         3199         8.89
    2940.927     0.900000         3245        10.00
    2969.599     0.912500         3290        11.43
    3008.511     0.925000         3334        13.33
    3108.863     0.937500         3380        16.00
    3131.391     0.943750         3404        17.78
    3160.063     0.950000         3425        20.00
    3188.735     0.956250         3447        22.86
    3207.167     0.962500         3469        26.67
    3233.791     0.968750         3492        32.00
    3254.271     0.971875         3503        35.56
    3274.751     0.975000         3514        40.00
    3297.279     0.978125         3528        45.71
    3311.615     0.981250         3537        53.33
    3319.807     0.984375         3548        64.00
    3327.999     0.985938         3557        71.11
    3334.143     0.987500         3561        80.00
    3340.287     0.989062         3565        91.43
    3350.527     0.990625         3572       106.67
    3356.671     0.992188         3576       128.00
    3362.815     0.992969         3579       142.22
    3377.151     0.993750         3582       160.00
    3379.199     0.994531         3585       182.86
    3395.583     0.995313         3589       213.33
    3397.631     0.996094         3590       256.00
    3401.727     0.996484         3592       284.44
    3403.775     0.996875         3593       320.00
    3418.111     0.997266         3595       365.71
    3434.495     0.997656         3596       426.67
    3446.783     0.998047         3597       512.00
    3448.831     0.998242         3598       568.89
    3452.927     0.998437         3599       640.00
    3457.023     0.998633         3600       731.43
    3457.023     0.998828         3600       853.33
    3469.311     0.999023         3602      1024.00
    3469.311     0.999121         3602      1137.78
    3469.311     0.999219         3602      1280.00
    3469.311     0.999316         3602      1462.86
    3469.311     0.999414         3602      1706.67
    3471.359     0.999512         3604      2048.00
    3471.359     1.000000         3604          inf
#[Mean    =     1838.259, StdDeviation   =      847.522]
#[Max     =     3469.312, Total count    =         3604]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3605 requests in 10.00s, 18.67MB read
Requests/sec:    360.50
Transfer/sec:      1.87MB
Running 20s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread calibration: mean lat.: 24.889ms, rate sampling interval: 130ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    34.87ms   73.10ms 383.23ms   92.37%
    Req/Sec    49.61     17.87   100.00     65.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.09ms
 75.000%   31.07ms
 90.000%   83.26ms
 99.000%  383.23ms
 99.900%  602.11ms
 99.990%  602.11ms
 99.999%  602.11ms
100.000%  602.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.555     0.000000            1         1.00
       0.815     0.100000           50         1.11
       2.709     0.200000          100         1.25
       3.337     0.300000          150         1.43
       9.543     0.400000          200         1.67
      11.087     0.500000          249         2.00
      11.663     0.550000          274         2.22
      12.407     0.600000          299         2.50
      13.767     0.650000          324         2.86
      18.655     0.700000          349         3.33
      31.071     0.750000          374         4.00
      37.055     0.775000          386         4.44
      42.623     0.800000          399         5.00
      50.303     0.825000          411         5.71
      60.447     0.850000          424         6.67
      68.991     0.875000          436         8.00
      72.063     0.887500          442         8.89
      83.711     0.900000          449        10.00
      94.399     0.912500          455        11.43
     109.631     0.925000          461        13.33
     119.615     0.937500          467        16.00
     141.951     0.943750          470        17.78
     153.343     0.950000          474        20.00
     212.863     0.956250          477        22.86
     231.167     0.962500          480        26.67
     250.879     0.968750          483        32.00
     259.839     0.971875          484        35.56
     299.775     0.975000          486        40.00
     312.575     0.978125          488        45.71
     316.671     0.981250          489        53.33
     356.607     0.984375          491        64.00
     356.607     0.985938          491        71.11
     371.967     0.987500          492        80.00
     383.231     0.989062          493        91.43
     397.567     0.990625          494       106.67
     426.751     0.992188          495       128.00
     426.751     0.992969          495       142.22
     426.751     0.993750          495       160.00
     457.983     0.994531          496       182.86
     457.983     0.995313          496       213.33
     514.047     0.996094          497       256.00
     514.047     0.996484          497       284.44
     514.047     0.996875          497       320.00
     514.047     0.997266          497       365.71
     514.047     0.997656          497       426.67
     602.111     0.998047          498       512.00
     602.111     1.000000          498          inf
#[Mean    =       34.870, StdDeviation   =       73.104]
#[Max     =      601.600, Total count    =          498]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1034 requests in 20.01s, 5.94MB read
Requests/sec:     51.67
Transfer/sec:    303.83KB
Running 10s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.69s   993.59ms   3.76s    60.44%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.64s 
 75.000%    2.47s 
 90.000%    3.09s 
 99.000%    3.76s 
 99.900%    3.99s 
 99.990%    4.02s 
 99.999%    4.02s 
100.000%    4.02s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.587     0.000000            1         1.00
     387.071     0.100000          396         1.11
     698.879     0.200000          792         1.25
     956.415     0.300000         1187         1.43
    1378.303     0.400000         1583         1.67
    1643.519     0.500000         1980         2.00
    1728.511     0.550000         2177         2.22
    1860.607     0.600000         2375         2.50
    2105.343     0.650000         2577         2.86
    2252.799     0.700000         2771         3.33
    2469.887     0.750000         2967         4.00
    2562.047     0.775000         3066         4.44
    2666.495     0.800000         3165         5.00
    2795.519     0.825000         3266         5.71
    2875.391     0.850000         3363         6.67
    2961.407     0.875000         3463         8.00
    3022.847     0.887500         3511         8.89
    3094.527     0.900000         3562        10.00
    3164.159     0.912500         3611        11.43
    3225.599     0.925000         3661        13.33
    3325.951     0.937500         3711        16.00
    3385.343     0.943750         3734        17.78
    3426.303     0.950000         3759        20.00
    3493.887     0.956250         3783        22.86
    3526.655     0.962500         3810        26.67
    3571.711     0.968750         3834        32.00
    3588.095     0.971875         3846        35.56
    3614.719     0.975000         3858        40.00
    3643.391     0.978125         3870        45.71
    3672.063     0.981250         3882        53.33
    3702.783     0.984375         3895        64.00
    3715.071     0.985938         3901        71.11
    3731.455     0.987500         3908        80.00
    3751.935     0.989062         3914        91.43
    3768.319     0.990625         3920       106.67
    3782.655     0.992188         3927       128.00
    3788.799     0.992969         3929       142.22
    3794.943     0.993750         3932       160.00
    3803.135     0.994531         3936       182.86
    3811.327     0.995313         3938       213.33
    3831.807     0.996094         3941       256.00
    3844.095     0.996484         3943       284.44
    3878.911     0.996875         3944       320.00
    3887.103     0.997266         3947       365.71
    3887.103     0.997656         3947       426.67
    3899.391     0.998047         3949       512.00
    3979.263     0.998242         3950       568.89
    3979.263     0.998437         3950       640.00
    3987.455     0.998633         3951       731.43
    3993.599     0.998828         3953       853.33
    3993.599     0.999023         3953      1024.00
    3993.599     0.999121         3953      1137.78
    3993.599     0.999219         3953      1280.00
    3995.647     0.999316         3954      1462.86
    3995.647     0.999414         3954      1706.67
    4012.031     0.999512         3955      2048.00
    4012.031     0.999561         3955      2275.56
    4012.031     0.999609         3955      2560.00
    4012.031     0.999658         3955      2925.71
    4012.031     0.999707         3955      3413.33
    4022.271     0.999756         3956      4096.00
    4022.271     1.000000         3956          inf
#[Mean    =     1690.396, StdDeviation   =      993.591]
#[Max     =     4020.224, Total count    =         3956]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3957 requests in 10.00s, 20.49MB read
Requests/sec:    395.52
Transfer/sec:      2.05MB
Running 20s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread calibration: mean lat.: 29.484ms, rate sampling interval: 170ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    32.17ms   55.90ms 269.05ms   89.61%
    Req/Sec    50.72     18.26    87.00     68.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.14ms
 75.000%   33.66ms
 90.000%   89.21ms
 99.000%  269.05ms
 99.900%  336.13ms
 99.990%  366.59ms
 99.999%  366.59ms
100.000%  366.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.521     0.000000            1         1.00
       0.823     0.100000           51         1.11
       2.845     0.200000          102         1.25
       3.581     0.300000          153         1.43
      10.231     0.400000          206         1.67
      11.143     0.500000          255         2.00
      11.751     0.550000          281         2.22
      12.135     0.600000          306         2.50
      14.127     0.650000          332         2.86
      21.551     0.700000          357         3.33
      33.663     0.750000          383         4.00
      37.599     0.775000          397         4.44
      42.367     0.800000          408         5.00
      51.263     0.825000          421         5.71
      60.031     0.850000          434         6.67
      73.791     0.875000          447         8.00
      82.175     0.887500          453         8.89
      89.215     0.900000          459        10.00
     106.623     0.912500          466        11.43
     112.703     0.925000          472        13.33
     123.967     0.937500          479        16.00
     146.431     0.943750          482        17.78
     151.423     0.950000          485        20.00
     164.351     0.956250          488        22.86
     182.015     0.962500          491        26.67
     214.271     0.968750          495        32.00
     217.727     0.971875          496        35.56
     219.647     0.975000          498        40.00
     223.231     0.978125          499        45.71
     246.783     0.981250          501        53.33
     252.287     0.984375          503        64.00
     252.287     0.985938          503        71.11
     254.207     0.987500          504        80.00
     269.055     0.989062          505        91.43
     310.015     0.990625          506       106.67
     320.255     0.992188          507       128.00
     320.255     0.992969          507       142.22
     320.255     0.993750          507       160.00
     322.815     0.994531          508       182.86
     322.815     0.995313          508       213.33
     336.127     0.996094          509       256.00
     336.127     0.996484          509       284.44
     336.127     0.996875          509       320.00
     336.127     0.997266          509       365.71
     336.127     0.997656          509       426.67
     366.591     0.998047          510       512.00
     366.591     1.000000          510          inf
#[Mean    =       32.170, StdDeviation   =       55.898]
#[Max     =      366.336, Total count    =          510]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1034 requests in 20.01s, 5.87MB read
Requests/sec:     51.67
Transfer/sec:    300.56KB
Running 10s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.80s   975.71ms   3.77s    59.95%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.65s 
 75.000%    2.56s 
 90.000%    3.25s 
 99.000%    3.77s 
 99.900%    3.88s 
 99.990%    3.95s 
 99.999%    3.95s 
100.000%    3.95s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.643     0.000000            1         1.00
     497.407     0.100000          401         1.11
     833.535     0.200000          801         1.25
    1241.087     0.300000         1204         1.43
    1459.199     0.400000         1602         1.67
    1651.711     0.500000         2003         2.00
    1813.503     0.550000         2203         2.22
    1954.815     0.600000         2406         2.50
    2073.599     0.650000         2605         2.86
    2297.855     0.700000         2804         3.33
    2564.095     0.750000         3005         4.00
    2680.831     0.775000         3105         4.44
    2803.711     0.800000         3204         5.00
    2953.215     0.825000         3306         5.71
    3055.615     0.850000         3405         6.67
    3162.111     0.875000         3505         8.00
    3213.311     0.887500         3555         8.89
    3250.175     0.900000         3605        10.00
    3299.327     0.912500         3655        11.43
    3350.527     0.925000         3705        13.33
    3414.015     0.937500         3755        16.00
    3446.783     0.943750         3780        17.78
    3467.263     0.950000         3808        20.00
    3502.079     0.956250         3830        22.86
    3545.087     0.962500         3858        26.67
    3579.903     0.968750         3881        32.00
    3594.239     0.971875         3893        35.56
    3606.527     0.975000         3906        40.00
    3618.815     0.978125         3918        45.71
    3645.439     0.981250         3932        53.33
    3680.255     0.984375         3943        64.00
    3715.071     0.985938         3949        71.11
    3747.839     0.987500         3956        80.00
    3760.127     0.989062         3963        91.43
    3780.607     0.990625         3970       106.67
    3784.703     0.992188         3974       128.00
    3790.847     0.992969         3977       142.22
    3796.991     0.993750         3980       160.00
    3821.567     0.994531         3985       182.86
    3827.711     0.995313         3987       213.33
    3835.903     0.996094         3990       256.00
    3837.951     0.996484         3991       284.44
    3842.047     0.996875         3993       320.00
    3866.623     0.997266         3995       365.71
    3868.671     0.997656         3996       426.67
    3872.767     0.998047         3998       512.00
    3872.767     0.998242         3998       568.89
    3874.815     0.998437         3999       640.00
    3878.911     0.998633         4000       731.43
    3880.959     0.998828         4001       853.33
    3889.151     0.999023         4003      1024.00
    3889.151     0.999121         4003      1137.78
    3889.151     0.999219         4003      1280.00
    3889.151     0.999316         4003      1462.86
    3889.151     0.999414         4003      1706.67
    3921.919     0.999512         4004      2048.00
    3921.919     0.999561         4004      2275.56
    3921.919     0.999609         4004      2560.00
    3921.919     0.999658         4004      2925.71
    3921.919     0.999707         4004      3413.33
    3954.687     0.999756         4005      4096.00
    3954.687     1.000000         4005          inf
#[Mean    =     1796.127, StdDeviation   =      975.711]
#[Max     =     3952.640, Total count    =         4005]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4006 requests in 10.00s, 20.86MB read
Requests/sec:    400.66
Transfer/sec:      2.09MB
Running 20s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread calibration: mean lat.: 28.328ms, rate sampling interval: 154ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    22.41ms   37.07ms 211.07ms   90.50%
    Req/Sec    50.22     15.88    84.00     76.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.91ms
 75.000%   26.05ms
 90.000%   56.90ms
 99.000%  211.07ms
 99.900%  323.84ms
 99.990%  335.36ms
 99.999%  335.36ms
100.000%  335.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.630     0.000000            1         1.00
       0.862     0.100000           51         1.11
       2.985     0.200000          101         1.25
       3.503     0.300000          152         1.43
       9.935     0.400000          202         1.67
      10.911     0.500000          254         2.00
      11.263     0.550000          279         2.22
      11.591     0.600000          303         2.50
      12.303     0.650000          329         2.86
      15.655     0.700000          354         3.33
      26.047     0.750000          379         4.00
      33.151     0.775000          392         4.44
      36.223     0.800000          404         5.00
      40.863     0.825000          417         5.71
      44.735     0.850000          431         6.67
      47.743     0.875000          442         8.00
      49.919     0.887500          449         8.89
      56.895     0.900000          455        10.00
      61.087     0.912500          461        11.43
      65.119     0.925000          469        13.33
      70.143     0.937500          474        16.00
      76.351     0.943750          477        17.78
      79.679     0.950000          480        20.00
      86.527     0.956250          483        22.86
      95.551     0.962500          487        26.67
     103.167     0.968750          490        32.00
     108.031     0.971875          491        35.56
     119.999     0.975000          493        40.00
     122.495     0.978125          494        45.71
     130.111     0.981250          496        53.33
     156.159     0.984375          498        64.00
     156.159     0.985938          498        71.11
     160.767     0.987500          499        80.00
     211.071     0.989062          500        91.43
     217.855     0.990625          501       106.67
     231.167     0.992188          502       128.00
     231.167     0.992969          502       142.22
     231.167     0.993750          502       160.00
     258.431     0.994531          503       182.86
     258.431     0.995313          503       213.33
     323.839     0.996094          504       256.00
     323.839     0.996484          504       284.44
     323.839     0.996875          504       320.00
     323.839     0.997266          504       365.71
     323.839     0.997656          504       426.67
     335.359     0.998047          505       512.00
     335.359     1.000000          505          inf
#[Mean    =       22.405, StdDeviation   =       37.072]
#[Max     =      335.104, Total count    =          505]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1034 requests in 20.00s, 5.87MB read
Requests/sec:     51.70
Transfer/sec:    300.72KB
Running 10s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread calibration: mean lat.: 1845.726ms, rate sampling interval: 6574ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     -nanus    -nanus   0.00us    0.00%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.00us
 75.000%    0.00us
 90.000%    0.00us
 99.000%    0.00us
 99.900%    0.00us
 99.990%    0.00us
 99.999%    0.00us
100.000%    0.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.000     1.000000            0          inf
#[Mean    =         -nan, StdDeviation   =         -nan]
#[Max     =        0.000, Total count    =            0]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3816 requests in 10.01s, 19.95MB read
Requests/sec:    381.16
Transfer/sec:      1.99MB
Running 20s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread calibration: mean lat.: 25.055ms, rate sampling interval: 145ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    28.74ms   43.98ms 174.72ms   87.75%
    Req/Sec    49.34     18.46    89.00     73.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.13ms
 75.000%   34.85ms
 90.000%   89.79ms
 99.000%  174.72ms
 99.900%  366.85ms
 99.990%  366.85ms
 99.999%  366.85ms
100.000%  366.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.518     0.000000            1         1.00
       0.842     0.100000           50         1.11
       2.583     0.200000          100         1.25
       3.487     0.300000          150         1.43
       9.871     0.400000          200         1.67
      11.127     0.500000          249         2.00
      11.711     0.550000          274         2.22
      12.719     0.600000          299         2.50
      15.759     0.650000          324         2.86
      26.271     0.700000          349         3.33
      34.847     0.750000          374         4.00
      38.047     0.775000          387         4.44
      43.935     0.800000          399         5.00
      50.751     0.825000          411         5.71
      57.471     0.850000          424         6.67
      71.103     0.875000          436         8.00
      84.031     0.887500          442         8.89
      94.271     0.900000          449        10.00
     100.287     0.912500          455        11.43
     107.135     0.925000          461        13.33
     115.519     0.937500          467        16.00
     123.583     0.943750          470        17.78
     126.719     0.950000          474        20.00
     130.047     0.956250          477        22.86
     137.215     0.962500          480        26.67
     150.655     0.968750          483        32.00
     153.215     0.971875          484        35.56
     156.927     0.975000          486        40.00
     163.839     0.978125          488        45.71
     166.655     0.981250          489        53.33
     167.935     0.984375          491        64.00
     167.935     0.985938          491        71.11
     171.263     0.987500          492        80.00
     174.719     0.989062          493        91.43
     189.183     0.990625          494       106.67
     209.919     0.992188          495       128.00
     209.919     0.992969          495       142.22
     209.919     0.993750          495       160.00
     221.567     0.994531          496       182.86
     221.567     0.995313          496       213.33
     251.135     0.996094          497       256.00
     251.135     0.996484          497       284.44
     251.135     0.996875          497       320.00
     251.135     0.997266          497       365.71
     251.135     0.997656          497       426.67
     366.847     0.998047          498       512.00
     366.847     1.000000          498          inf
#[Mean    =       28.744, StdDeviation   =       43.976]
#[Max     =      366.592, Total count    =          498]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1034 requests in 20.01s, 5.65MB read
Requests/sec:     51.68
Transfer/sec:    289.00KB
Running 10s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.92s     1.08s    4.12s    58.31%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.83s 
 75.000%    2.78s 
 90.000%    3.40s 
 99.000%    4.12s 
 99.900%    4.73s 
 99.990%    4.74s 
 99.999%    4.74s 
100.000%    4.74s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.313     0.000000            1         1.00
     571.903     0.100000          365         1.11
     803.327     0.200000          731         1.25
    1116.159     0.300000         1094         1.43
    1473.535     0.400000         1460         1.67
    1825.791     0.500000         1823         2.00
    2065.407     0.550000         2007         2.22
    2289.663     0.600000         2188         2.50
    2482.175     0.650000         2371         2.86
    2619.391     0.700000         2553         3.33
    2781.183     0.750000         2735         4.00
    2883.583     0.775000         2827         4.44
    3016.703     0.800000         2918         5.00
    3104.767     0.825000         3010         5.71
    3166.207     0.850000         3100         6.67
    3280.895     0.875000         3192         8.00
    3350.527     0.887500         3236         8.89
    3395.583     0.900000         3282        10.00
    3461.119     0.912500         3327        11.43
    3526.655     0.925000         3374        13.33
    3577.855     0.937500         3420        16.00
    3631.103     0.943750         3441        17.78
    3663.871     0.950000         3465        20.00
    3717.119     0.956250         3487        22.86
    3753.983     0.962500         3511        26.67
    3813.375     0.968750         3533        32.00
    3862.527     0.971875         3546        35.56
    3876.863     0.975000         3555        40.00
    3921.919     0.978125         3567        45.71
    3938.303     0.981250         3579        53.33
    3971.071     0.984375         3590        64.00
    3983.359     0.985938         3595        71.11
    4040.703     0.987500         3601        80.00
    4108.287     0.989062         3607        91.43
    4124.671     0.990625         3612       106.67
    4358.143     0.992188         3618       128.00
    4399.103     0.992969         3621       142.22
    4468.735     0.993750         3625       160.00
    4489.215     0.994531         3627       182.86
    4554.751     0.995313         3629       213.33
    4685.823     0.996094         3632       256.00
    4698.111     0.996484         3634       284.44
    4706.303     0.996875         3635       320.00
    4714.495     0.997266         3637       365.71
    4718.591     0.997656         3638       426.67
    4722.687     0.998047         3641       512.00
    4722.687     0.998242         3641       568.89
    4722.687     0.998437         3641       640.00
    4726.783     0.998633         3642       731.43
    4726.783     0.998828         3642       853.33
    4730.879     0.999023         3643      1024.00
    4730.879     0.999121         3643      1137.78
    4734.975     0.999219         3645      1280.00
    4734.975     0.999316         3645      1462.86
    4734.975     0.999414         3645      1706.67
    4734.975     0.999512         3645      2048.00
    4734.975     0.999561         3645      2275.56
    4734.975     0.999609         3645      2560.00
    4734.975     0.999658         3645      2925.71
    4734.975     0.999707         3645      3413.33
    4739.071     0.999756         3646      4096.00
    4739.071     1.000000         3646          inf
#[Mean    =     1916.906, StdDeviation   =     1078.407]
#[Max     =     4734.976, Total count    =         3646]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3647 requests in 10.00s, 18.76MB read
Requests/sec:    364.52
Transfer/sec:      1.88MB
Running 20s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread calibration: mean lat.: 30.833ms, rate sampling interval: 179ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    20.16ms   28.62ms 130.43ms   87.35%
    Req/Sec    49.45     16.53    89.00     72.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.30ms
 75.000%   29.42ms
 90.000%   55.68ms
 99.000%  130.43ms
 99.900%  184.19ms
 99.990%  184.19ms
 99.999%  184.19ms
100.000%  184.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.509     0.000000            1         1.00
       0.803     0.100000           50         1.11
       1.046     0.200000          100         1.25
       3.283     0.300000          150         1.43
       4.491     0.400000          200         1.67
      10.295     0.500000          249         2.00
      11.063     0.550000          274         2.22
      11.511     0.600000          299         2.50
      12.311     0.650000          324         2.86
      14.983     0.700000          349         3.33
      29.423     0.750000          374         4.00
      31.615     0.775000          386         4.44
      33.279     0.800000          400         5.00
      37.727     0.825000          411         5.71
      43.519     0.850000          424         6.67
      48.959     0.875000          436         8.00
      51.839     0.887500          442         8.89
      55.807     0.900000          449        10.00
      60.607     0.912500          455        11.43
      65.471     0.925000          461        13.33
      70.207     0.937500          467        16.00
      73.663     0.943750          470        17.78
      78.719     0.950000          474        20.00
      85.375     0.956250          477        22.86
      99.263     0.962500          480        26.67
     101.887     0.968750          483        32.00
     103.103     0.971875          484        35.56
     111.295     0.975000          486        40.00
     117.695     0.978125          488        45.71
     119.039     0.981250          489        53.33
     123.071     0.984375          491        64.00
     123.071     0.985938          491        71.11
     125.439     0.987500          492        80.00
     130.431     0.989062          493        91.43
     131.839     0.990625          494       106.67
     134.527     0.992188          495       128.00
     134.527     0.992969          495       142.22
     134.527     0.993750          495       160.00
     158.335     0.994531          496       182.86
     158.335     0.995313          496       213.33
     175.999     0.996094          497       256.00
     175.999     0.996484          497       284.44
     175.999     0.996875          497       320.00
     175.999     0.997266          497       365.71
     175.999     0.997656          497       426.67
     184.191     0.998047          498       512.00
     184.191     1.000000          498          inf
#[Mean    =       20.160, StdDeviation   =       28.619]
#[Max     =      184.064, Total count    =          498]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1034 requests in 20.01s, 5.25MB read
Requests/sec:     51.67
Transfer/sec:    268.68KB
Running 10s test @ http://10.104.148.16:80
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.42s     1.21s    4.67s    59.09%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.51s 
 75.000%    3.50s 
 90.000%    3.96s 
 99.000%    4.67s 
 99.900%    5.02s 
 99.990%    5.08s 
 99.999%    5.08s 
100.000%    5.08s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.849     0.000000            1         1.00
     776.191     0.100000          346         1.11
    1146.879     0.200000          692         1.25
    1503.231     0.300000         1038         1.43
    1925.119     0.400000         1384         1.67
    2508.799     0.500000         1730         2.00
    2699.263     0.550000         1904         2.22
    2928.639     0.600000         2076         2.50
    3149.823     0.650000         2249         2.86
    3348.479     0.700000         2422         3.33
    3502.079     0.750000         2595         4.00
    3543.039     0.775000         2682         4.44
    3616.767     0.800000         2770         5.00
    3719.167     0.825000         2854         5.71
    3786.751     0.850000         2943         6.67
    3864.575     0.875000         3030         8.00
    3903.487     0.887500         3071         8.89
    3962.879     0.900000         3114        10.00
    4012.031     0.912500         3159        11.43
    4044.799     0.925000         3200        13.33
    4104.191     0.937500         3244        16.00
    4136.959     0.943750         3265        17.78
    4188.159     0.950000         3287        20.00
    4243.455     0.956250         3308        22.86
    4296.703     0.962500         3330        26.67
    4341.759     0.968750         3352        32.00
    4354.047     0.971875         3362        35.56
    4374.527     0.975000         3373        40.00
    4395.007     0.978125         3386        45.71
    4423.679     0.981250         3395        53.33
    4448.255     0.984375         3405        64.00
    4526.079     0.985938         3411        71.11
    4546.559     0.987500         3416        80.00
    4657.151     0.989062         3423        91.43
    4722.687     0.990625         3427       106.67
    4784.127     0.992188         3432       128.00
    4853.759     0.992969         3436       142.22
    4874.239     0.993750         3438       160.00
    4894.719     0.994531         3441       182.86
    4902.911     0.995313         3443       213.33
    4927.487     0.996094         3446       256.00
    4935.679     0.996484         3449       284.44
    4935.679     0.996875         3449       320.00
    4956.159     0.997266         3450       365.71
    4964.351     0.997656         3452       426.67
    4988.927     0.998047         3453       512.00
    4988.927     0.998242         3453       568.89
    4993.023     0.998437         3454       640.00
    4997.119     0.998633         3455       731.43
    4997.119     0.998828         3455       853.33
    5017.599     0.999023         3456      1024.00
    5017.599     0.999121         3456      1137.78
    5025.791     0.999219         3457      1280.00
    5025.791     0.999316         3457      1462.86
    5025.791     0.999414         3457      1706.67
    5070.847     0.999512         3458      2048.00
    5070.847     0.999561         3458      2275.56
    5070.847     0.999609         3458      2560.00
    5070.847     0.999658         3458      2925.71
    5070.847     0.999707         3458      3413.33
    5083.135     0.999756         3459      4096.00
    5083.135     1.000000         3459          inf
#[Mean    =     2416.035, StdDeviation   =     1210.430]
#[Max     =     5079.040, Total count    =         3459]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3460 requests in 10.00s, 18.34MB read
Requests/sec:    345.85
Transfer/sec:      1.83MB